/*using System.Runtime.InteropServices;

namespace imgui_net_export;

[StructLayout(LayoutKind.Explicit, Size = 0x0024)]
public struct VARIANT
{
    [FieldOffset(0x0000)] public VARENUM mVT;
    [FieldOffset(0x0002)] public ushort m0002;
    [FieldOffset(0x0004)] public ushort m0004;
    [FieldOffset(0x0006)] public ushort m0006;
    
    [FieldOffset(0x0008)] public long mInt64;
    [FieldOffset(0x0008)] public ulong mUInt64;
    [FieldOffset(0x0008)] public int mInt32;
    [FieldOffset(0x0008)] public uint mUInt32;
    [FieldOffset(0x0008)] public short mInt16;
    [FieldOffset(0x0008)] public ushort mUInt16;
    [FieldOffset(0x0008)] public byte mUInt8;
    [FieldOffset(0x0008)] public sbyte mInt8;
}*/